In [1]:
my_dict = {
    "name": ["John",'jane','jones'],
    "age": [30,45,32],
    "is_student": [False,False,False],
    "grades": [90, 85, 88]
}

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(my_dict)

In [5]:
df

    name  age  is_student  grades
0   John   30       False      90
1   jane   45       False      85
2  jones   32       False      88

In [12]:
filt = df['age'] > 35

In [13]:
df[filt]

   name  age  is_student  grades
1  jane   45       False      85

In [14]:
df.loc[filt]

   name  age  is_student  grades
1  jane   45       False      85

In [15]:
df.loc[filt, 'age']

1    45
Name: age, dtype: int64

In [23]:
filt_2 = (df['name'] == 'John') & (df['age'] >= 20)

In [24]:
df[filt_2]

   name  age  is_student  grades
0  John   30       False      90

In [25]:
df.loc[filt_2, "is_student"]

0    False
Name: is_student, dtype: bool

In [26]:
filt_2 = (df['name'] == 'John') | (df['age'] >= 20)

In [28]:
df.loc[filt_2, "grades"]

0    90
1    85
2    88
Name: grades, dtype: int64

In [31]:
df.rename(columns={"name":"student_name"}, inplace=True)

In [32]:
df

  student_name  age  is_student  grades
0         John   30       False      90
1         jane   45       False      85
2        jones   32       False      88

In [33]:
df.columns = [x.upper() for x in df.columns]
df

  STUDENT_NAME  AGE  IS_STUDENT  GRADES
0         John   30       False      90
1         jane   45       False      85
2        jones   32       False      88

In [34]:
df.columns= df.columns.str.replace("_", " ")

In [35]:
df

  STUDENT NAME  AGE  IS STUDENT  GRADES
0         John   30       False      90
1         jane   45       False      85
2        jones   32       False      88

In [37]:
df.loc[2] = ['jones', '34', "False", " 88"]

In [38]:
df

  STUDENT NAME AGE IS STUDENT GRADES
0         John  30      False     90
1         jane  45      False     85
2        jones  34      False     88

In [39]:
df.loc[2, ['IS STUDENT', 'GRADES']]

IS STUDENT    False
GRADES           88
Name: 2, dtype: object

In [40]:
df.loc[2, ['IS STUDENT', 'GRADES']] = ["True", "54"]

In [41]:
df

  STUDENT NAME AGE IS STUDENT GRADES
0         John  30      False     90
1         jane  45      False     85
2        jones  34       True     54

In [45]:
df.at[2, 'GRADES'] = "45"
df

  STUDENT NAME AGE IS STUDENT GRADES
0         John  30      False     90
1         jane  45      False     85
2        jones  34       True     45

In [49]:
df['STUDENT NAME'].apply(len)

0    4
1    4
2    5
Name: STUDENT NAME, dtype: int64

In [50]:
def update_email(email):
    return email.upper()

In [51]:
df['STUDENT NAME'].apply(update_email)

0     JOHN
1     JANE
2    JONES
Name: STUDENT NAME, dtype: object

In [52]:
df['STUDENT NAME'] = df['STUDENT NAME'].apply(update_email)

In [53]:
df

  STUDENT NAME AGE IS STUDENT GRADES
0         JOHN  30      False     90
1         JANE  45      False     85
2        JONES  34       True     45